[
    {
        "bookId": 1,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://down-ph.img.susercontent.com/file/a8dba1f0cdfd4b785f499f75ccd970b6",
        "review": "An inspiring and timeless tale that weaves a rich narrative about self-discovery, the courage to follow one's dreams, and the universal truths that bind humanity. Through the story of Santiago, a humble shepherd boy who embarks on an extraordinary journey to fulfill his personal legend, readers are reminded of the power of perseverance, intuition, and the importance of listening to one’s heart. Paulo Coelho's simple yet profound storytelling delivers a unique blend of philosophy and adventure, making 'The Alchemist' a transformative and life-affirming read that continues to captivate readers around the globe.",
        "totalPages": 208,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Adventure", "Philosophy"],
        "publisher": "HarperOne",
        "yearOfPublishing": 1988
    },
    {
        "bookId": 2,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://m.media-amazon.com/images/I/81CkzCy2mAL._AC_UF350,350_QL80_.jpg",
        "review": "A deeply moving and profoundly impactful story that explores themes of justice, morality, and human dignity through the lens of a small Southern town. Harper Lee masterfully crafts a narrative that intertwines the innocence of childhood with the harsh realities of racial prejudice and inequality. Told through the eyes of young Scout Finch, the novel captures the timeless struggle between right and wrong, illuminated by her father, Atticus Finch, who stands as a beacon of integrity and compassion. 'To Kill a Mockingbird' is not only a poignant social commentary but also a heartfelt exploration of empathy, resilience, and the human spirit's capacity for change, making it an enduring classic for generations to come.",
        "totalPages": 281,
        "rating": 5.0,
        "category": "Classic",
        "tags": ["Drama", "Social Issues"],
        "publisher": "J.B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 3,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://cdn11.bigcommerce.com/s-miyiditov4/images/stencil/original/products/2136/11306/2016.1__59237.1697143838.jpg?c=2&imbypass=on&imbypass=on",
        "review": "A captivating and richly detailed adventure through the mythical land of Middle-earth. 'The Hobbit' is a timeless masterpiece that follows the journey of Bilbo Baggins, a reluctant hero whose courage and resourcefulness are tested in unimaginable ways. Tolkien's unparalleled world-building introduces readers to a realm brimming with magic, peril, and wonder, from the treacherous Misty Mountains to the lair of Smaug the dragon. Through Bilbo's transformation from a simple hobbit into a cunning and courageous adventurer, the story celebrates themes of bravery, friendship, and self-discovery. This foundational work of modern fantasy continues to enchant readers with its unforgettable characters, intricate storytelling, and profound sense of wonder.",
        "totalPages": 310,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["Adventure", "Epic"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 4,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://m.media-amazon.com/images/I/71zNHngqfPL._AC_UF1000,1000_QL80_.jpg",
        "review": "A poignant and tragic narrative that examines the decadence and moral decay of the Jazz Age. 'The Great Gatsby' is a masterpiece of 20th-century literature, offering a searing critique of the American Dream and the pursuit of wealth at the expense of integrity. Through the eyes of Nick Carraway, readers witness the glamorous yet hollow lives of Jay Gatsby and Daisy Buchanan, whose love story unfolds amidst a backdrop of opulence and betrayal. Fitzgerald’s lyrical prose captures the disillusionment and yearning of a generation, making this novel a timeless meditation on love, ambition, and the fleeting nature of happiness. Its themes and characters continue to resonate with readers, serving as a mirror to society’s own aspirations and flaws.",
        "totalPages": 180,
        "rating": 4.4,
        "category": "Classic",
        "tags": ["Romance", "Tragedy"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 5,
        "bookName": "Sapiens",
        "author": "Yuval Noah Harari",
        "image": "https://booxworm.lk/cdn/shop/files/sapiens-a-brief-history-of-humankind-by-yuval-noah-harari-booxworm.png?v=1731436805&width=600",
        "review": "A thought-provoking and illuminating exploration of human history, 'Sapiens' takes readers on a journey through the milestones that shaped our species. Yuval Noah Harari skillfully examines humanity’s evolution, from the cognitive and agricultural revolutions to the scientific and technological breakthroughs that define modern civilization. With profound insights and bold hypotheses, Harari challenges conventional narratives and offers a fresh perspective on how culture, politics, and economics intertwine with biology and evolution. This groundbreaking work not only provides a comprehensive overview of humanity's past but also sparks critical discussions about its future, making it an essential read for anyone seeking to understand the complexities of human existence.",
        "totalPages": 443,
        "rating": 4.7,
        "category": "Non-Fiction",
        "tags": ["History", "Anthropology"],
        "publisher": "Harvill Secker",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 6,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://www.peterpauper.com/cdn/shop/products/9781441341709.PT01_1080x.png?v=1689196950",
        "review": "A timeless masterpiece that offers a witty and sharp commentary on the intricacies of society and relationships. Jane Austen’s 'Pride and Prejudice' captivates readers with its unforgettable characters, particularly the spirited and intelligent Elizabeth Bennet, and the brooding yet honorable Mr. Darcy. Through their evolving relationship, Austen masterfully explores themes of love, class, and self-awareness. Her elegant prose and keen social observations reveal the absurdities and hypocrisies of her time, all while delivering a romantic story that continues to resonate. This novel’s enduring appeal lies in its perfect blend of humor, wit, and emotional depth, making it a cornerstone of English literature and a beloved classic across generations.",
        "totalPages": 279,
        "rating": 4.6,
        "category": "Romance",
        "tags": ["Classic", "Society"],
        "publisher": "T. Egerton",
        "yearOfPublishing": 1813
    }
]
